driver-tests/bpelse/TestsForBugs/Bug6431708/testJBI/test/TestCase0/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loan="http://localhost/loanRequestorBpel/loanRequestor">
  <soapenv:Body>
    <loan:loanRequest>
      <loan:applicantSocialSecurityNumber>1234567</loan:applicantSocialSecurityNumber>
      <loan:applicantName>JBIuser</loan:applicantName>
      <loan:applicantAddress>aaaa</loan:applicantAddress>
      <loan:applicantEmailAddress>bbbb</loan:applicantEmailAddress>
      <loan:applicantAge>25</loan:applicantAge>
      <loan:applicantGender>Male</loan:applicantGender>
      <loan:applicantAnnualSalary>1.051732E7</loan:applicantAnnualSalary>
      <loan:amountRequested>1.051732E7</loan:amountRequested>
    </loan:loanRequest>
  </soapenv:Body>
</soapenv:Envelope>